In [2]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Downloading pandas-3.0.0-cp314-cp314-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=2.3.3 in c:\users\srush\appdata\roaming\python\python314\site-packages (from pandas) (2.4.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\srush\appdata\roaming\python\python314\site-packages (from pandas) (2.9.0.post0)
Collecting tzdata (from pandas)
  Downloading tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\srush\appdata\roaming\python\python314\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-3.0.0-cp314-cp314-win_amd64.whl (9.9 MB)
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   ---- ----------------------------------- 1.0/9.9 MB 11.1 MB/s eta 0:00:01
   ------------- -------------------------- 3.4/9.9 MB 11.1 MB/s eta 0:00:01
   ----------------------- ---------------- 5.8/9.9 MB 11.1 MB/s eta 0:00:01
   ------------------------------------- -- 9.2/9.9 MB 12.5 MB/s eta 0:00:01
   ---------------------------------------- 9.9/9.9 MB 12.3 MB/s  0:00:00
Downloading tzdata-2025.3-py2.py3-none-any.whl (348 kB)
Installing collected packages: tzdata, pandas

   ---------------------------------------- 0/2 [tzdata]
   ---------------------------------------- 0/2 [tzdata]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   -------------------- ------------------- 1/2 [pandas]
   ---------------------------------------- 2/2 [pandas]

Successfully installed pandas-3.0.0 tzdata-2025.3
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.3 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

In [ ]:
Importing the pandas,numpy library to work with data in Python.
import pandas as pd
import numpy as np

In [ ]:
# To Create a series
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
# To check the type of the data
type(pd.Series([1, 2, 3, 4, 5]))

pandas.Series

In [ ]:
# To check the series data
data = pd.Series([1, 2, 3, 4, 5]) # To check the series
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
# To assign index to the data

data = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e']) # To assign index to the 
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
# To give name to the series
data.name = "Numbers" # To give name to the series
data # To check the series data

a    1
b    2
c    3
d    4
e    5
Name: Numbers, dtype: int64

In [ ]:
# To check the size of the data
data.size # returns the number of elements in the Series or DataFrame.

5

In [ ]:
#   to check the shape of the data
data.shape # returns a tuple representing the dimensionality of the data.

(5,)

In [ ]:
# To Check the values of the data
data.values # returns the underlying data as a NumPy array.

array([1, 2, 3, 4, 5])

In [ ]:
# 
data['a'],data['b'] # To access the element using the labels
data[0],data[1] # To access the element using the index position

(np.int64(1), np.int64(2))

In [ ]:
#data.index returns the row labels (index) of a Series or DataFrame.
data.index # returns the row labels (index) of a Series or DataFrame.

Index(['a', 'b', 'c', 'd', 'e'], dtype='str')

In [ ]:
#To  access the element using the labels
data.loc['a'::2],data.iloc[3] # loc is used to access the element using the labels and iloc is used to access the element using the index position.

(a    1
 c    3
 e    5
 Name: Numbers, dtype: int64,
 np.int64(4))

In [27]:
data.loc[["a","c","e"]],data.iloc[3] # loc is used to access the element using the labels and iloc is used to access the element using the index position.

(a    1
 c    3
 e    5
 Name: Numbers, dtype: int64,
 np.int64(4))

In [32]:
# To Create a Sample DataFrame  

data={
    "USN":[1,2,3,4],
    "Name":["Srushti","Sneha","Druvi","Druti"],
    "Branch":["CSE","CSE","CSE","CSE"],
    "Age":[21,22,23,24]
}

In [ ]:
# To create a DataFrame from the dictionary data.
df=pd.DataFrame(data) 
df

   USN     Name Branch  Age
0    1  Srushti    CSE   21
1    2    Sneha    CSE   22
2    3    Druvi    CSE   23
3    4    Druti    CSE   24

In [ ]:
# How to load the data from the csv file
data = pd.read_csv("C:\\Users\\srush\\OneDrive\\Desktop\\AIML Internship\\AIML-Internship\\Day 7_File_Handling\\Company_Data.csv") 
data                         # To load the data from the csv file

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
0,9.50,138,73,11,276,120,Bad,42,17,Yes,Yes
1,11.22,111,48,16,260,83,Good,65,10,Yes,Yes
2,10.06,113,35,10,269,80,Medium,59,12,Yes,Yes
3,7.40,117,100,4,466,97,Medium,55,14,Yes,Yes
4,4.15,141,64,3,340,128,Bad,38,13,Yes,No
...,...,...,...,...,...,...,...,...,...,...,...
395,12.57,138,108,17,203,128,Good,33,14,Yes,Yes
396,6.14,139,23,3,37,120,Medium,55,11,No,Yes
397,7.41,162,26,12,368,159,Medium,40,18,Yes,Yes
398,5.94,100,79,7,284,95,Bad,50,12,Yes,Yes
399,9.71,134,37,0,27,120,Good,49,16,Yes,Yes

In [43]:
data.head() # To display the first five rows of the DataFrame.

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
0,9.50,138,73,11,276,120,Bad,42,17,Yes,Yes
1,11.22,111,48,16,260,83,Good,65,10,Yes,Yes
2,10.06,113,35,10,269,80,Medium,59,12,Yes,Yes
3,7.40,117,100,4,466,97,Medium,55,14,Yes,Yes
4,4.15,141,64,3,340,128,Bad,38,13,Yes,No

In [44]:
data.tail( ) # To display the last three rows of the DataFrame.

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
395,12.57,138,108,17,203,128,Good,33,14,Yes,Yes
396,6.14,139,23,3,37,120,Medium,55,11,No,Yes
397,7.41,162,26,12,368,159,Medium,40,18,Yes,Yes
398,5.94,100,79,7,284,95,Bad,50,12,Yes,Yes
399,9.71,134,37,0,27,120,Good,49,16,Yes,Yes

In [45]:
data.info() # To check the information about the data.

<class 'pandas.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    int64
 6   ShelveLoc    400 non-null    str
 7   Age          400 non-null    int64
 8   Education    400 non-null    int64
 9   Urban        400 non-null    str
 10  US           400 non-null    str
dtypes: float64(1), int64(7), str(3)
memory usage: 34.5 KB

In [47]:
data.shape

(400, 11)

In [48]:
data.sample() # To display a random sample of the data.

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
393,5.57,109,51,10,26,120,Medium,30,17,No,Yes

In [ ]:
#To access the particular column from the DataFrame.
data["Sales"] # To access the column "Sales" from the DataFrame.

0       9.50
1      11.22
2      10.06
3       7.40
4       4.15
       ...
395    12.57
396     6.14
397     7.41
398     5.94
399     9.71
Name: Sales, Length: 400, dtype: float64

In [51]:
data[["Sales","Price"]] # To access the columns "Sales" and "Price" from the DataFrame.

     Sales  Price
0     9.50    120
1    11.22     83
2    10.06     80
3     7.40     97
4     4.15    128
..     ...    ...
395  12.57    128
396   6.14    120
397   7.41    159
398   5.94     95
399   9.71    120

[400 rows x 2 columns]

In [ ]:
type(data.Sales) # To check the type of the column "Sales" from the DataFrame.

pandas.Series

In [56]:
data.isnull().sum() # To check the null values in the data.

Sales          0
CompPrice      0
Income         0
Advertising    0
Population     0
Price          0
ShelveLoc      0
Age            0
Education      0
Urban          0
US             0
dtype: int64

In [57]:
data.isnull()

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
395,False,False,False,False,False,False,False,False,False,False,False
396,False,False,False,False,False,False,False,False,False,False,False
397,False,False,False,False,False,False,False,False,False,False,False
398,False,False,False,False,False,False,False,False,False,False,False
399,False,False,False,False,False,False,False,False,False,False,False

In [63]:
data.loc[0:5, ["Sales","Price","Age"]]

   Sales  Price  Age
0   9.50    120   42
1  11.22     83   65
2  10.06     80   59
3   7.40     97   55
4   4.15    128   38
5  10.81     72   78

In [64]:
data.loc["0":"1", ["Sales","Price"]]

   Sales  Price
0   9.50    120
1  11.22     83

In [65]:
datas=pd.read_csv("C:\\Users\\srush\\OneDrive\\Desktop\\AIML Internship\\AIML-Internship\\Day 9_Pandas\\test2.csv")
datas

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [68]:
datas.iloc[1:3, 0:2]

   Unnamed: 0     Name
1           1      Bob
2           2  Charlie

In [78]:
datas.rename(columns={"Name":"Names","Age":"Ages","Department":"Branch"}, inplace=True) # To rename the column "Name" to "Names" in the DataFrame.
datas

   Unnamed: 0    Names  Ages   Branch   Salary
0           0    Alice  25.0       HR  50000.0
1           1      Bob  30.0       IT  60000.0
2           2  Charlie  35.0  Finance  70000.0
3           3    David   NaN       IT  62000.0
4           4      Eve  29.0       HR      NaN
5           5    Alice  25.0       HR  50000.0

In [70]:
datas.columns

Index(['Unnamed: 0', 'Names', 'Age', 'Department', 'Salary'], dtype='str')

In [106]:
datas

     Names  Ages   Branch   Salary
0    Alice  25.0       HR  50000.0
1      Bob  30.0       IT  60000.0
2  Charlie  35.0  Finance  70000.0
3    David   NaN       IT  62000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  50000.0

In [122]:
datas.drop('Ages',axis=1,inplace=True)
datas # To drop the column "Unnamed: 0" from the DataFrame.

    Branch   Salary
0       HR  50000.0
1       IT  60000.0
2  Finance  70000.0
3       IT  62000.0
4       HR      NaN
5       HR  50000.0

In [126]:
datas["Name"] = ["Srushti","Sneha","Druvi","Druti","xyz","abc"] # To change the values of the column "Name" in the DataFrame.
datas

    Branch   Salary     Name
0       HR  50000.0  Srushti
1       IT  60000.0    Sneha
2  Finance  70000.0    Druvi
3       IT  62000.0    Druti
4       HR      NaN      xyz
5       HR  50000.0      abc

In [127]:
type(datas["Salary"]) # To check the type of the data in the column "Salary".

pandas.Series

In [128]:
datas["Salary"]=datas["Salary"] + 500 # To add 500 to the values in the column "Salary".
datas

    Branch   Salary     Name
0       HR  50500.0  Srushti
1       IT  60500.0    Sneha
2  Finance  70500.0    Druvi
3       IT  62500.0    Druti
4       HR      NaN      xyz
5       HR  50500.0      abc

In [129]:
datas["Age"] = ["15","20","25","30","35","40"] # To change the values of the column "Age" in the DataFrame.
datas

    Branch   Salary     Name Age
0       HR  50500.0  Srushti  15
1       IT  60500.0    Sneha  20
2  Finance  70500.0    Druvi  25
3       IT  62500.0    Druti  30
4       HR      NaN      xyz  35
5       HR  50500.0      abc  40

In [131]:
datas["Age"] = datas["Age"].astype(int) # To change the data type of the column "Age" to integer.
datas

    Branch   Salary     Name  Age
0       HR  50500.0  Srushti   15
1       IT  60500.0    Sneha   20
2  Finance  70500.0    Druvi   25
3       IT  62500.0    Druti   30
4       HR      NaN      xyz   35
5       HR  50500.0      abc   40

In [132]:
datas[datas["Age"] > 25] # To filter the data based on the condition that the age is greater than 25.

  Branch   Salary   Name  Age
3     IT  62500.0  Druti   30
4     HR      NaN    xyz   35
5     HR  50500.0    abc   40

In [134]:
datas["Age"] = datas["Age"].fillna(value=datas["Age"].mean()) # To fill the missing values in the column "Age" with the mean of the column.
datas["Salary"] = datas["Salary"].fillna(value=datas["Salary"].mean())# To fill the missing values in the column "Salary" with the mean of the column.
datas

    Branch   Salary     Name  Age
0       HR  50500.0  Srushti   15
1       IT  60500.0    Sneha   20
2  Finance  70500.0    Druvi   25
3       IT  62500.0    Druti   30
4       HR  58900.0      xyz   35
5       HR  50500.0      abc   40

In [135]:
datas=pd.read_csv("C:\\Users\\srush\\OneDrive\\Desktop\\AIML Internship\\AIML-Internship\\Day 9_Pandas\\test2.csv")
datas

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [136]:
datas["Salary"].mean() 
datas# To access the column "Salary" from the DataFrame.

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [137]:
datas["Salary"]= datas["Salary"].fillna(value=datas["Salary"].mean()) # To change the type of the data in the column "Salary" to float.
datas

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [139]:
datas["Department"].value_counts() # To count the unique values in the column "Department".

Department
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [153]:
datas.Age.bfill()

0    25.0
1    30.0
2    35.0
3    29.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [150]:
datas.Age.ffill()

0    25.0
1    30.0
2    35.0
3    35.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [155]:
datas.Salary.bfill()

0    50000.0
1    60000.0
2    70000.0
3    62000.0
4    58400.0
5    50000.0
Name: Salary, dtype: float64

In [ ]:
## Column level operation
datas["level"]=datas["Salary"].apply(lambda x: x+500) # To create a new column "level" based on the values in the column "Salary".\
datas

   Unnamed: 0     Name   Age Department   Salary    level
0           0    Alice  25.0         HR  50000.0  50500.0
1           1      Bob  30.0         IT  60000.0  60500.0
2           2  Charlie  35.0    Finance  70000.0  70500.0
3           3    David   NaN         IT  62000.0  62500.0
4           4      Eve  29.0         HR  58400.0  58900.0
5           5    Alice  25.0         HR  50000.0  50500.0

In [171]:
## Row level operation 
datas["level"]=datas.apply(lambda s: "High" if s["Salary"]>60000  else "Low",axis=1) # To create a new column "level" based on the values in the column "Salary".
datas

   Unnamed: 0     Name   Age Department   Salary level
0           0    Alice  25.0         HR  50000.0   Low
1           1      Bob  30.0         IT  60000.0   Low
2           2  Charlie  35.0    Finance  70000.0  High
3           3    David   NaN         IT  62000.0  High
4           4      Eve  29.0         HR  58400.0   Low
5           5    Alice  25.0         HR  50000.0   Low